StephaneOwley/FW_STM32WL55_AT_SLAVE_DUAL/CM4/Sigfox/App/sgfx_at.c
  /*Send Bytes to Sigfox Network */
  if (dlFlag == 0)
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_FALSE);
    if (error != SFX_ERR_NONE)
    {
      if (error == SFX_ERR_INT_PROCESS_UPLINK_CS_TIMEOUT)
      {
        return AT_TX_TIMEOUT;
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
        return AT_LIB_ERROR;
      }
    }
  }
  else
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_TRUE);

    if (error == SFX_ERR_NONE)
    {
      print_rx(dl_msg, SGFX_MAX_DL_PAYLOAD_SIZE * 2);
    }
    else if (error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      return AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
      return AT_LIB_ERROR;
    }
  }
  return AT_OK;
  /* USER CODE BEGIN AT_SendFrame_2 */

  /* USER CODE END AT_SendFrame_2 */
}

ATEerror_t AT_SendHexFrame(const char *param)
{
  /* USER CODE BEGIN AT_SendHexFrame_1 */

  /* USER CODE END AT_SendHexFrame_1 */
  uint8_t ul_msg[SGFX_MAX_UL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t dl_msg[SGFX_MAX_DL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint32_t dlFlag = 0;   /* default */
  uint32_t  ul_size = 0;
  uint32_t nbParam;
  uint32_t txRepeat = 1;
  sfx_error_t error;

  /* convert AT param to sgfx param */
  /* ul_size, ul_msg[ul_size], dlFlag, txRepeat*/

  tiny_sscanf(param, "%u", &ul_size);

  if (ul_size > SGFX_MAX_UL_PAYLOAD_SIZE)
  {
    return AT_PARAM_ERROR;
  }
  param += 2;

  for (int32_t i = 0; i < ul_size; i++)
  {
    ul_msg[i] = param[i];
  }

  if (param[ul_size] == ',')
  {
    nbParam = tiny_sscanf(&param[ul_size + 1], "%u,%u", &dlFlag, &txRepeat);

    if (nbParam > 2)
    {
      return AT_PARAM_ERROR;
    }
  }

  /*Send Bytes to Sigfox Network */
  if (dlFlag == 0)
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_FALSE);
    if (error != SFX_ERR_NONE)
    {
      if (error == SFX_ERR_INT_PROCESS_UPLINK_CS_TIMEOUT)
      {
        return AT_TX_TIMEOUT;
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
        return AT_LIB_ERROR;
      }
    }
  }
  else
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_TRUE);

    if (error == SFX_ERR_NONE)
    {
      print_rx(dl_msg, SGFX_MAX_DL_PAYLOAD_SIZE * 2);
    }
    else if (error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      return AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
      return AT_LIB_ERROR;
    }
  }
  return AT_OK;
  /* USER CODE BEGIN AT_SendHexFrame_2 */

  /* USER CODE END AT_SendHexFrame_2 */
}

ATEerror_t AT_version_get(const char *param)
{
  /* USER CODE BEGIN AT_version_get_1 */

  /* USER CODE END AT_version_get_1 */
  FEAT_INFO_Param_t *p_cm0plus_specific_features_info;
  uint32_t feature_version;
  sfx_u8 *version;
  sfx_u8 size;

  /* Get CM4 Sigfox APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "M4_APP_VERSION:      V%X.%X.%X\r\n",
          (uint8_t)(APP_VERSION_MAIN),
          (uint8_t)(APP_VERSION_SUB1),
          (uint8_t)(APP_VERSION_SUB2));

  /* Get CM0 Sigfox APP version*/
  p_cm0plus_specific_features_info = MBMUXIF_SystemGetFeatCapabInfoPtr(FEAT_INFO_SYSTEM_ID);
  feature_version = p_cm0plus_specific_features_info->Feat_Info_Feature_Version;
  APP_LOG(TS_OFF, VLEVEL_M, "M0PLUS_APP_VERSION:  V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  /* Get MW Sigfox info */
  p_cm0plus_specific_features_info = MBMUXIF_SystemGetFeatCapabInfoPtr(FEAT_INFO_OWLEY_ID);
  feature_version = p_cm0plus_specific_features_info->Feat_Info_Feature_Version;
  APP_LOG(TS_OFF, VLEVEL_M, "MW_SIGFOX_VERSION:   V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  /* Get MW SubGhz_Phy info */
  p_cm0plus_specific_features_info = MBMUXIF_SystemGetFeatCapabInfoPtr(FEAT_INFO_RADIO_ID);
  feature_version = p_cm0plus_specific_features_info->Feat_Info_Feature_Version;
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:    V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  SIGFOX_API_get_version(&version, &size, VERSION_SIGFOX);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_RF);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_MCU);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_SE);
  print_n(version, size);
  AT_PRINTF("\r\n");

  return AT_OK;
  /* USER CODE BEGIN AT_version_get_2 */

  /* USER CODE END AT_version_get_2 */
}

ATEerror_t AT_DevPac_get(const char *param)
{
  /* USER CODE BEGIN AT_DevPac_get_1 */

  /* USER CODE END AT_DevPac_get_1 */
  sfx_u8 SfxPac[PAC_LENGTH];

  sfx_error_t error;

  error = SIGFOX_API_get_initial_pac(SfxPac);

  if (error != SFX_ERR_NONE)
  {
    return AT_LIB_ERROR;
  }

  for (int32_t i = 0; i < PAC_LENGTH; i++)
  {
    AT_PRINTF("%02X", SfxPac[i]);
  }
  AT_PRINTF("\r\n");
  return AT_OK;
  /* USER CODE BEGIN AT_DevPac_get_2 */

  /* USER CODE END AT_DevPac_get_2 */
}

ATEerror_t AT_DevId_get(const char *param)
{
  /* USER CODE BEGIN AT_DevId_get_1 */

  /* USER CODE END AT_DevId_get_1 */
  sfx_u8 SfxId[ID_LENGTH];

  sfx_error_t error;

  error = SIGFOX_API_get_device_id(SfxId);

  if (error != SFX_ERR_NONE)
  {
    return AT_LIB_ERROR;
  }
  for (int32_t i = ID_LENGTH; i > 0; i--)
  {
    AT_PRINTF("%02X", SfxId[i - 1]);
  }
  AT_PRINTF("\r\n");
  return AT_OK;
  /* USER CODE BEGIN AT_DevId_get_2 */

