StephaneOwley/FW_STM32WL55_AT_SLAVE_DUAL/CM4/Sigfox/App/sgfx_at.c
  /* USER CODE END AT_DevId_get_2 */
}

ATEerror_t AT_PublicKey_set(const char *param)
{
  /* USER CODE BEGIN AT_PublicKey_set_1 */

  /* USER CODE END AT_PublicKey_set_1 */
  if ((param[0] == '0') && (param[1] == '\0'))
  {
    E2P_Write_KeyType(CREDENTIALS_KEY_PRIVATE);
  }
  else if ((param[0] == '1') && (param[1] == '\0'))
  {
    E2P_Write_KeyType(CREDENTIALS_KEY_PUBLIC);
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_PublicKey_set_2 */

  /* USER CODE END AT_PublicKey_set_2 */
}

ATEerror_t AT_PublicKey_get(const char *param)
{
  /* USER CODE BEGIN AT_PublicKey_get_1 */

  /* USER CODE END AT_PublicKey_get_1 */
  AT_PRINTF("%d\r\n", (uint8_t) E2P_Read_KeyType());

  return AT_OK;
  /* USER CODE BEGIN AT_PublicKey_get_2 */

  /* USER CODE END AT_PublicKey_get_2 */
}

ATEerror_t AT_PayloadEncryption_set(const char *param)
{
  /* USER CODE BEGIN AT_PayloadEncryption_set_1 */

  /* USER CODE END AT_PayloadEncryption_set_1 */
  if ((param[0] == '0') && (param[1] == '\0'))
  {
    E2P_Write_EncryptionFlag(0);
  }
  else if ((param[0] == '1') && (param[1] == '\0'))
  {
    E2P_Write_EncryptionFlag(1);
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_PayloadEncryption_set_2 */

  /* USER CODE END AT_PayloadEncryption_set_2 */
}

ATEerror_t AT_PayloadEncryption_get(const char *param)
{
  /* USER CODE BEGIN AT_PayloadEncryption_get_1 */

  /* USER CODE END AT_PayloadEncryption_get_1 */
  AT_PRINTF("%d\r\n", (uint8_t) E2P_Read_EncryptionFlag());

  return AT_OK;
  /* USER CODE BEGIN AT_PayloadEncryption_get_2 */

  /* USER CODE END AT_PayloadEncryption_get_2 */
}

ATEerror_t AT_bat_get(const char *param)
{
  /* USER CODE BEGIN AT_bat_get_1 */

  /* USER CODE END AT_bat_get_1 */
  print_u(SYS_GetBatteryLevel());
  return AT_OK;
  /* USER CODE BEGIN AT_bat_get_2 */

  /* USER CODE END AT_bat_get_2 */
}

ATEerror_t AT_test_cw(const char *param)
{
  /* USER CODE BEGIN AT_test_cw_1 */

  /* USER CODE END AT_test_cw_1 */
  uint32_t freq = 0;

  if (tiny_sscanf(param, "%u", &freq) > 1)
  {
    return AT_PARAM_ERROR;
  }

  if (freq == 0)
  {
    sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

    sfx_u32 config_words[3] = {0};

    E2P_Read_ConfigWords(sfx_rc, config_words);

    SIGFOX_API_stop_continuous_transmission();
    /*reopen after test*/
    if (SIGFOX_reopen_and_reconf(sfx_rc, config_words) != SFX_ERR_NONE)
    {
      return AT_RECONF_ERROR;
    }
  }
  else if ((freq > ((uint32_t) 100e6)) && (freq < ((uint32_t) 1e9)))
  {
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq, SFX_NO_MODULATION) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((freq >  100) && (freq <  1000))
  {
    /* user meant Mega... */
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq * 1000000, SFX_NO_MODULATION) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_test_cw_2 */

  /* USER CODE END AT_test_cw_2 */
}

ATEerror_t AT_test_pn(const char *param)
{
  /* USER CODE BEGIN AT_test_pn_1 */

  /* USER CODE END AT_test_pn_1 */
  uint32_t freq = 0;
  uint32_t bitrate = 0;
  sfx_modulation_type_t sfx_bitrate = SFX_DBPSK_100BPS;

  if (tiny_sscanf(param, "%u,%u", &freq, &bitrate) > 2)
  {
    return AT_PARAM_ERROR;
  }

  if (bitrate == 100)
  {
    sfx_bitrate = SFX_DBPSK_100BPS;
  }
  else if (bitrate == 600)
  {
    sfx_bitrate = SFX_DBPSK_600BPS;
  }
  else if (bitrate == 0)
  {
    if (freq != 0)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  if (freq == 0)
  {
    sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

    sfx_u32 config_words[3] = {0};

    E2P_Read_ConfigWords(sfx_rc, config_words);

    SIGFOX_API_stop_continuous_transmission();
    /*reopen after test*/
    if (SIGFOX_reopen_and_reconf(sfx_rc, config_words) != SFX_ERR_NONE)
    {
      return AT_RECONF_ERROR;
    }
  }
  else if ((freq > ((uint32_t) 100e6)) && (freq < ((uint32_t) 1e9)))
  {
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq, sfx_bitrate) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((freq >  100) && (freq <  1000))
  {
    /* user meant Mega... */
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq * 1000000, sfx_bitrate) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_test_pn_2 */

  /* USER CODE END AT_test_pn_2 */
}

ATEerror_t AT_test_mode(const char *param)
{
  /* USER CODE BEGIN AT_test_mode_1 */

  /* USER CODE END AT_test_mode_1 */
  char test_mode;
  sfx_test_mode_t tm;
  sfx_rc_enum_t rc = SFX_RC1;
  sfx_error_t sfx_error;

  sfx_u32 config_words_restore[3] = {0};

  sfx_rc_enum_t rc_enum_restore = E2P_Read_Rc();

  ATEerror_t at_status = AT_OK;
  sfx_error = SFX_ERR_NONE;

  if ((param[0] == '1') && (param[1] == ','))
  {
    rc = SFX_RC1;
    param += 2;
  }
  else if ((param[0] == '2') && (param[1] == ','))
  {
    rc = SFX_RC2;
    param += 2;
  }
  else if ((param[0] == '3') && (param[2] == ','))
  {
    if ((param[1] == 'A') || (param[1] == 'a'))
    {
      rc = SFX_RC3A;
      param += 3;
    }
    else if ((param[1] == 'C') || (param[1] == 'c'))
    {
      rc = SFX_RC3C;
      param += 3;
    }
    else
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((param[0] == '4') && (param[1] == ','))
  {
    rc = SFX_RC4;
    param += 2;
  }
  else if ((param[0] == '5') && (param[1] == ','))
  {
    rc = SFX_RC5;
    param += 2;
  }
  else if ((param[0] == '6') && (param[1] == ','))
  {
    rc = SFX_RC6;
    param += 2;
  }
  else if ((param[0] == '7') && (param[1] == ','))
  {
    rc = SFX_RC7;
    param += 2;
  }
  else
  {
    return AT_PARAM_ERROR;
  }

