StephaneOwley/FW_STM32WL55_AT_SLAVE_DUAL/CM4/Sigfox/App/sgfx_at.c
  /* USER CODE END isHex_2 */
}

static uint8_t Char2Nibble(char Char)
{
  /* USER CODE BEGIN Char2Nibble_1 */

  /* USER CODE END Char2Nibble_1 */
  if (((Char >= '0') && (Char <= '9')))
  {
    return Char - '0';
  }
  else if (((Char >= 'a') && (Char <= 'f')))
  {
    return Char - 'a' + 10;
  }
  else if ((Char >= 'A') && (Char <= 'F'))
  {
    return Char - 'A' + 10;
  }
  else
  {
    return 0xF0;
  }
  /* USER CODE BEGIN Char2Nibble_2 */

  /* USER CODE END Char2Nibble_2 */
}

static sfx_error_t SIGFOX_reopen_and_reconf(sfx_rc_enum_t sfx_rc,  sfx_u32 *config_words)
{
  /* USER CODE BEGIN SIGFOX_reopen_and_reconf_1 */

  /* USER CODE END SIGFOX_reopen_and_reconf_1 */
  sfx_error_t error = SFX_ERR_NONE;

  /*record RCZ*/
  switch (sfx_rc)
  {
    case SFX_RC1:
    {
      sfx_rc_t SgfxRc = RC1;
      error = OWLEY_API_open(&SgfxRc);
      break;
    }
    case SFX_RC2:
    {
      sfx_rc_t SgfxRc = RC2;

      error = OWLEY_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, RC2_SET_STD_TIMER_ENABLE);
      }

      break;
    }
    case SFX_RC3A:
    {
      sfx_rc_t SgfxRc = RC3A;

      error = OWLEY_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC3C:
    {
      sfx_rc_t SgfxRc = RC3C;

      error = OWLEY_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC4:
    {
      sfx_rc_t SgfxRc = RC4;

      error = OWLEY_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, RC4_SET_STD_TIMER_ENABLE);
      }

      break;
    }
    case SFX_RC5:
    {
      sfx_rc_t SgfxRc = RC5;

      error = OWLEY_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC6:
    {
      sfx_rc_t SgfxRc = RC6;

      error = OWLEY_API_open(&SgfxRc);

      break;
    }
    case SFX_RC7:
    {
      sfx_rc_t SgfxRc = RC7;

      error = OWLEY_API_open(&SgfxRc);

      break;
    }
    default:
    {
      error = SFX_ERR_API_OPEN;
      break;
    }
  }
  return error;
  /* USER CODE BEGIN SIGFOX_reopen_and_reconf_2 */

  /* USER CODE END SIGFOX_reopen_and_reconf_2 */
}

static sfx_error_t testmode_12(sfx_rc_enum_t rc_enum)
{
  /* USER CODE BEGIN testmode_12_1 */

  /* USER CODE END testmode_12_1 */
  sfx_error_t sfx_err = SFX_ERR_NONE;

  sfx_u8 test_data[1];

  sfx_key_type_t key = E2P_Read_KeyType();

  test_data[0] = 0xAB;

  sfx_u32 config_words[3] = {0};

  E2P_Read_ConfigWords(rc_enum, config_words);

  /*open for test mode 12 with right rc_enum and conf*/
  sfx_err = SIGFOX_reopen_and_reconf(rc_enum, config_words);

  /* Switch public key ON */
  E2P_Write_KeyType(CREDENTIALS_KEY_PUBLIC);

  /* Only call SIGFOX_API_send_xxx */
  sfx_err = SIGFOX_API_send_frame(test_data, 1 /* size of the test data */, (sfx_u8 *)SFX_NULL, 2, SFX_FALSE);

  /* Switch back key type */
  E2P_Write_KeyType(key);

  /* Close the lib before return */
  SIGFOX_API_close();

  return sfx_err;
  /* USER CODE BEGIN testmode_12_2 */

  /* USER CODE END testmode_12_2 */
}

/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */
